FSAndDisk_Test/FS_Disk_SSD_MP400_8TB_NVMe_scripts/mp4008TB_fs_fio_test_write_ranseq/rand_write_block_32K_32_16_jobs.out
rand_write_test: (g=0): rw=randwrite, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=1
...
fio-3.28
Starting 16 processes

rand_write_test: (groupid=0, jobs=16): err= 0: pid=2628776: Thu May  9 23:47:36 2024
  write: IOPS=24.9k, BW=778MiB/s (815MB/s)(200GiB/263358msec); 0 zone resets
    slat (usec): min=4, max=1086, avg=21.13, stdev= 8.27
    clat (usec): min=3, max=507676, avg=615.09, stdev=1103.38
     lat (usec): min=65, max=507694, avg=636.46, stdev=1104.15
    clat percentiles (usec):
     |  1.00th=[  306],  5.00th=[  379], 10.00th=[  392], 20.00th=[  412],
     | 30.00th=[  433], 40.00th=[  441], 50.00th=[  453], 60.00th=[  465],
     | 70.00th=[  486], 80.00th=[  515], 90.00th=[  685], 95.00th=[ 1303],
     | 99.00th=[ 4948], 99.50th=[ 5342], 99.90th=[ 6063], 99.95th=[ 6783],
     | 99.99th=[23725]
   bw (  KiB/s): min=311425, max=2182150, per=100.00%, avg=799720.09, stdev=19125.90, samples=8370
   iops        : min= 9732, max=68190, avg=24989.78, stdev=597.66, samples=8370
  lat (usec)   : 4=0.01%, 20=0.01%, 50=0.01%, 100=0.48%, 250=0.12%
  lat (usec)   : 500=75.29%, 750=15.37%, 1000=2.26%
  lat (msec)   : 2=3.30%, 4=1.35%, 10=1.81%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=1.61%, sys=4.10%, ctx=6561196, majf=0, minf=798
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,6553600,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=778MiB/s (815MB/s), 778MiB/s-778MiB/s (815MB/s-815MB/s), io=200GiB (215GB), run=263358-263358msec

Disk stats (read/write):
  nvme0n1: ios=0/6549542, merge=0/52, ticks=0/3875640, in_queue=3876496, util=100.00%

Test Time: 2024-05-09 23:47:36
Device Name: filetest.txt
Device Info: