FSAndDisk_Test/FS_Disk_SSD_MP400_8TB_NVMe_scripts/mp4008TB_fs_fio_test_write_ranseq/seq_write_block_1M_16_8_jobs.out
seq_write_test: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
fio-3.28
Starting 8 processes

seq_write_test: (groupid=0, jobs=8): err= 0: pid=2525344: Thu May  9 11:28:40 2024
  write: IOPS=661, BW=661MiB/s (693MB/s)(200GiB/309706msec); 0 zone resets
    slat (usec): min=51, max=14001, avg=207.67, stdev=144.49
    clat (usec): min=956, max=102853, avg=11880.03, stdev=4523.43
     lat (usec): min=1150, max=103048, avg=12088.49, stdev=4538.75
    clat percentiles (usec):
     |  1.00th=[ 7111],  5.00th=[ 7308], 10.00th=[ 7504], 20.00th=[ 8029],
     | 30.00th=[ 8291], 40.00th=[ 8979], 50.00th=[ 9896], 60.00th=[13566],
     | 70.00th=[14615], 80.00th=[15533], 90.00th=[17957], 95.00th=[19268],
     | 99.00th=[22414], 99.50th=[23987], 99.90th=[45351], 99.95th=[49546],
     | 99.99th=[68682]
   bw (  KiB/s): min=362496, max=1171456, per=100.00%, avg=677737.44, stdev=25980.22, samples=4947
   iops        : min=  354, max= 1144, avg=661.47, stdev=25.36, samples=4947
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.03%, 10=50.27%, 20=46.89%, 50=2.76%
  lat (msec)   : 100=0.05%, 250=0.01%
  cpu          : usr=0.52%, sys=1.44%, ctx=205933, majf=0, minf=1756
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,204800,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=661MiB/s (693MB/s), 661MiB/s-661MiB/s (693MB/s-693MB/s), io=200GiB (215GB), run=309706-309706msec

Disk stats (read/write):
  nvme0n1: ios=0/409602, merge=0/62, ticks=0/4486436, in_queue=4488020, util=100.00%

Test Time: 2024-05-09 11:28:40
Device Name: filetest.txt
Device Info: