FSAndDisk_Test/FS_Disk_SSD_MP400_8TB_NVMe_scripts/mp4008TB_fs_fio_test_write_ranseq/seq_write_block_8K_8_16_jobs.out
seq_write_test: (g=0): rw=write, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
fio-3.28
Starting 16 processes

seq_write_test: (groupid=0, jobs=16): err= 0: pid=2599243: Thu May  9 19:49:41 2024
  write: IOPS=86.1k, BW=673MiB/s (705MB/s)(200GiB/304484msec); 0 zone resets
    slat (usec): min=3, max=872, avg=14.02, stdev= 4.46
    clat (usec): min=3, max=461423, avg=169.26, stdev=439.88
     lat (usec): min=32, max=461436, avg=183.45, stdev=440.07
    clat percentiles (usec):
     |  1.00th=[   82],  5.00th=[   94], 10.00th=[   99], 20.00th=[  106],
     | 30.00th=[  113], 40.00th=[  118], 50.00th=[  121], 60.00th=[  124],
     | 70.00th=[  130], 80.00th=[  137], 90.00th=[  147], 95.00th=[  174],
     | 99.00th=[ 1614], 99.50th=[ 3654], 99.90th=[ 4817], 99.95th=[ 5080],
     | 99.99th=[ 6390]
   bw (  KiB/s): min=328610, max=1192976, per=100.00%, avg=689504.74, stdev=14451.63, samples=9723
   iops        : min=41069, max=149122, avg=86186.04, stdev=1806.47, samples=9723
  lat (usec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.11%, 100=11.20%
  lat (usec)   : 250=85.02%, 500=1.39%, 750=0.39%, 1000=0.34%
  lat (msec)   : 2=0.73%, 4=0.37%, 10=0.44%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=4.18%, sys=9.95%, ctx=26218300, majf=0, minf=612
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,26214400,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=673MiB/s (705MB/s), 673MiB/s-673MiB/s (705MB/s-705MB/s), io=200GiB (215GB), run=304484-304484msec

Disk stats (read/write):
  nvme0n1: ios=0/26209941, merge=0/61, ticks=0/4001686, in_queue=4002684, util=100.00%

Test Time: 2024-05-09 19:49:41
Device Name: filetest.txt
Device Info: